Статистика работы механизмов/Конфигурация/DataProcessors/_НачислениеДепозитарныхКомиссий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_НачислениеДепозитарныхКомиссий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияБрокера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияСтороннегоБрокера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачисленияКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаСтороннегоБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияСтороннегоБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияСтороннегоБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументНачисления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачислениеЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийНачисления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийОплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_НачислениеДепозитарныхКомиссий/_НачислениеДепозитарныхКомиссий/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ДекорацияКомиссияБрокераРазница.Заголовок           = "";
	Элементы.ДекорацияКомиссияСтороннегоБрокераРазница.Заголовок = "";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.ДатаНачисленияКомиссии = ТекущаяДата();
	Объект.ДатаОплатыКомиссии	  = ТекущаяДата();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	Объект.КонецПериода = КонецМесяца(Объект.НачалоПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	Объект.НачалоПериода = НачалоМесяца(Объект.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияБрокераПриИзменении(Элемент)
	
	ОбновитьНадписиКомиссии();
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияСтороннегоБрокераПриИзменении(Элемент)
	
	Если Объект.КомиссияСтороннегоБрокера <> 0 Тогда
		РаспределитьКомиссиюСтороннегоБрокера();
	КонецЕсли;
	
	ОбновитьНадписиКомиссии(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Объект.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ПодписантДолжность = СтруктураДанныхКонтактногоЛица.Должность;
	ВыбранноеЗначение  = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыКомиссии

&НаКлиенте
Процедура КомиссииКомиссияСтороннегоБрокераПриИзменении(Элемент)
	
	РассчитатьИтоговуюКомиссию();
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссииКомиссияБрокераПриИзменении(Элемент)
	
	РассчитатьИтоговуюКомиссию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Заполнить");
	Попытка
		ВыполнитьЗаполнение(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнение(ПараметрыСессии)
	
	Если Не ЗначениеЗаполнено(Объект.Брокер) Тогда		
		Предупреждение("Не указан брокер!");
		ДобавитьТекстОшибки(ПараметрыСессии, "Не указан брокер");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
	ОбновитьНадписиКомиссии();  
	ОбновитьНадписиКомиссии(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ОтметитьВсе");
	Попытка
		УстановитьСнятьФлажки(Истина);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СнятьВсе");
	Попытка
		УстановитьСнятьФлажки(Ложь);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыНачисления(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СоздатьДокументыНачисления");
	Попытка
		ВыполнитьСозданиеДокументовНачисления(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСозданиеДокументовНачисления(ПараметрыСессии)
	
	Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета");
	
	Для Каждого СтрокаКомиссии Из Объект.Комиссии Цикл
		
		Если (Не СтрокаКомиссии.Обрабатывать) ИЛИ СтрокаКомиссии.КомиссияИтого = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыДокумента = Новый Структура;
		ПараметрыДокумента.Вставить("Организация", 				    Объект.Организация);
		ПараметрыДокумента.Вставить("СчетДоверительногоУправления", СтрокаКомиссии.СчетДоверительногоУправления);
		ПараметрыДокумента.Вставить("Период", 					    Объект.КонецПериода);
		ПараметрыДокумента.Вставить("Валюта", 					    Валюта);
		ПараметрыДокумента.Вставить("Сумма", 					    СтрокаКомиссии.КомиссияИтого);
		ПараметрыДокумента.Вставить("Документ", 					СтрокаКомиссии.ДокументНачисления); 
		ПараметрыДокумента.Вставить("ДатаНачисления", 				Объект.ДатаНачисленияКомиссии);
		
		РезультатОбработки = СоздатьОбновитьДокументНачисленияЗадолженности(ПараметрыДокумента, ПараметрыСессии);
		
		Если Не РезультатОбработки.Результат Тогда
			СтрокаКомиссии.КомментарийНачисления = РезультатОбработки.Комментарий;			
		Иначе
			ДокументЗаписан = ЗначениеЗаполнено(РезультатОбработки.Документ);
			СтрокаКомиссии.КомментарийНачисления = "";
			СтрокаКомиссии.ДокументНачисления    = РезультатОбработки.Документ;
			СтрокаКомиссии.Обрабатывать          = Ложь;			
			ОтобразитьИзменениеДанных(РезультатОбработки.Документ, ?(ДокументЗаписан, ВидИзмененияДанных.Изменение, ВидИзмененияДанных.Добавление));
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыОплаты(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СоздатьДокументыОплаты");
	Попытка
		ВыполнитьСозданиеДокументовОплаты(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСозданиеДокументовОплаты(ПараметрыСессии)
	
	Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета");
	Для Каждого СтрокаКомиссии Из Объект.Комиссии Цикл
		
		Если Не СтрокаКомиссии.Обрабатывать Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыДокумента = Новый Структура;
		ПараметрыДокумента.Вставить("Организация", 				    Объект.Организация);
		ПараметрыДокумента.Вставить("СчетДоверительногоУправления", СтрокаКомиссии.СчетДоверительногоУправления);
		ПараметрыДокумента.Вставить("Контрагент", 				    Объект.Брокер);
		ПараметрыДокумента.Вставить("Период", 					    Объект.КонецПериода);
		ПараметрыДокумента.Вставить("Валюта", 					    Валюта);
		ПараметрыДокумента.Вставить("Сумма", 					    СтрокаКомиссии.КомиссияИтого);
		ПараметрыДокумента.Вставить("ДокументНачисления", 			СтрокаКомиссии.ДокументНачисления);
		ПараметрыДокумента.Вставить("Документ", 					СтрокаКомиссии.ДокументОплаты);
		ПараметрыДокумента.Вставить("ДатаОплаты", 					Объект.ДатаОплатыКомиссии);
		
		РезультатОбработки = СоздатьОбновитьДокументОплаты(ПараметрыДокумента, ПараметрыСессии);
		
		Если Не РезультатОбработки.Результат Тогда
			СтрокаКомиссии.КомментарийОплаты = РезультатОбработки.Комментарий;			
		Иначе
			ДокументЗаписан = ЗначениеЗаполнено(РезультатОбработки.Документ);
			СтрокаКомиссии.КомментарийОплаты = "";
			СтрокаКомиссии.ДокументОплаты    = РезультатОбработки.Документ;
			СтрокаКомиссии.Обрабатывать          = Ложь;			
			ОтобразитьИзменениеДанных(РезультатОбработки.Документ, ?(ДокументЗаписан, ВидИзмененияДанных.Изменение, ВидИзмененияДанных.Добавление));
		КонецЕсли;
		
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РаспределитьКомиссиюСтороннегоБрокера()
	
	
	ТаблицаКомиссий = Новый ТаблицаЗначений;
	ТаблицаКомиссий.Колонки.Добавить("СчетДоверительногоУправления");
	ТаблицаКомиссий.Колонки.Добавить("ЦеннаяБумага");
	ТаблицаКомиссий.Колонки.Добавить("КомиссияБрокера");
	ТаблицаКомиссий.Колонки.Добавить("КомиссияСтороннегоБрокера");
	
	Для Каждого СтрокаКомиссии Из Объект.Расчет Цикл
		НоваяСтрока = ТаблицаКомиссий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКомиссии);
	КонецЦикла;
	
	РаспределитьСуммуПоКолонкеТаблицы(Объект.КомиссияСтороннегоБрокера, ТаблицаКомиссий, "КомиссияСтороннегоБрокера", "КомиссияБрокера");
	
	Для Каждого СтрокаКомиссии Из Объект.Расчет Цикл
		НайдСтроки = ТаблицаКомиссий.НайтиСтроки(Новый Структура("СчетДоверительногоУправления, ЦеннаяБумага", СтрокаКомиссии.СчетДоверительногоУправления, СтрокаКомиссии.ЦеннаяБумага));
		Если НайдСтроки.Количество() > 0 Тогда
			// Одна строка
			СтрокаКомиссии.КомиссияСтороннегоБрокера = НайдСтроки[0].КомиссияСтороннегоБрокера;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаКомиссий.Свернуть("СчетДоверительногоУправления", "КомиссияСтороннегоБрокера");
	Для Каждого СтрокаКомиссии Из Объект.Комиссии Цикл
		НайдСтроки = ТаблицаКомиссий.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СтрокаКомиссии.СчетДоверительногоУправления));
		Если НайдСтроки.Количество() > 0 Тогда
			// Одна строка
			СтрокаКомиссии.КомиссияСтороннегоБрокера = НайдСтроки[0].КомиссияСтороннегоБрокера;
			СтрокаКомиссии.КомиссияИтого = СтрокаКомиссии.КомиссияБрокера + СтрокаКомиссии.КомиссияСтороннегоБрокера; 			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // РаспределитьКомиссиюСтороннегоБрокера()

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат       = ОбработкаОбъект.ВыполнитьЗапросВСКД();
	Результат.Колонки.Добавить("КомиссияБрокера");
	Результат.ЗаполнитьЗначения(0, "КомиссияБрокера");
	Результат.Колонки.Добавить("КомиссияСтороннегоБрокера");
	Результат.ЗаполнитьЗначения(0, "КомиссияСтороннегоБрокера");
	МассивЦБЗаДень = Новый Массив;
	
	// Распределям комиссии за каждый день по счетам ДУ по каждой бумаге
	ВремТаблица     = Результат.СкопироватьКолонки();
		
	ТекДата = Объект.НачалоПериода;
	Пока ТекДата <= Объект.КонецПериода Цикл		
			
		ТекОтбор = Новый Структура("Период", КонецДня(ТекДата));
		НайдСтроки = Результат.НайтиСтроки(ТекОтбор);
		Если НайдСтроки.Количество() = 0 Тогда
			ТекДата = ТекДата + 86400;
			Продолжить;
		КонецЕсли;
		
		МассивЦБЗаДень.Очистить();
		Для Каждого НайдСтрока Из НайдСтроки Цикл
			Если МассивЦБЗаДень.Найти(НайдСтрока.ЦеннаяБумага) = Неопределено Тогда
				МассивЦБЗаДень.Добавить(НайдСтрока.ЦеннаяБумага);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЦБЗаДень Из МассивЦБЗаДень Цикл
			
			ВремТаблица.Очистить();
			
			ТекОтбор = Новый Структура("Период, ЦеннаяБумага", КонецДня(ТекДата), ЦБЗаДень);
			НайдСтроки = Результат.НайтиСтроки(ТекОтбор);
			Для Каждого НайдСтрока Из НайдСтроки Цикл
				НоваяСтрока = ВремТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайдСтрока);
			КонецЦикла;
			
			РаспределитьСуммуПоКолонкеТаблицы(ВремТаблица.Итог("КомиссияБрокераРасчетная"), ВремТаблица, "КомиссияБрокера", "БазаРаспределенияКомиссии");
			
			Сч = 0;
			Для Каждого НайдСтрока Из НайдСтроки Цикл
				ВремСтрока = ВремТаблица.Получить(Сч);
				ЗаполнитьЗначенияСвойств(НайдСтрока, ВремСтрока);
				Сч = Сч + 1;
			КонецЦикла;
		
		КонецЦикла;
					
		ТекДата = ТекДата + 86400;
		
	КонецЦикла;	
	
	// Удалим служебные строки с пустым счетом ДУ
	ТекОтбор = Новый Структура("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
	СтрокиКУдалению = Результат.НайтиСтроки(ТекОтбор);
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл  		
		Результат.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	РезультатСвернуто = Результат.Скопировать();
	
	РезультатСвернуто.Свернуть("СчетДоверительногоУправления, Ценнаябумага", "КомиссияБрокера, КомиссияСтороннегоБрокера");
	РезультатСвернуто.Сортировать("СчетДоверительногоУправления");
	
	ТаблицаКомиссийСтороннегоБрокера = Новый ТаблицаЗначений;
	Если Объект.КомиссияСтороннегоБрокера > 0 Тогда
		РаспределитьСуммуПоКолонкеТаблицы(Объект.КомиссияСтороннегоБрокера, РезультатСвернуто, "КомиссияСтороннегоБрокера", "КомиссияБрокера");
		ТаблицаКомиссийСтороннегоБрокера = РезультатСвернуто.Скопировать();
		ТаблицаКомиссийСтороннегоБрокера.Свернуть("СчетДоверительногоУправления", "КомиссияСтороннегоБрокера");
	КонецЕсли;
	
	Объект.Расчет.Очистить();
	Объект.Комиссии.Очистить();
	
	Для Каждого СтрокаРезультата Из РезультатСвернуто Цикл
		НоваяСтрока = Объект.Расчет.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
		НоваяСтрока.КомиссияИтого = НоваяСтрока.КомиссияБрокера + НоваяСтрока.КомиссияСтороннегоБрокера;
	КонецЦикла;
	
	РезультатСвернуто = Результат.Скопировать();
	РезультатСвернуто.Свернуть("СчетДоверительногоУправления, ДокументНачисления, ДокументОплаты", "КомиссияБрокера, КомиссияСтороннегоБрокера");
	
	Для Каждого СтрокаРезультата Из РезультатСвернуто Цикл
		
		Если ТаблицаКомиссийСтороннегоБрокера.Количество() > 0 Тогда 
			НайдСтроки = ТаблицаКомиссийСтороннегоБрокера.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СтрокаРезультата.СчетДоверительногоУправления));	
			Если НайдСтроки.Количество() > 0 Тогда
				// Строка одна
				СтрокаРезультата.КомиссияСтороннегоБрокера = НайдСтроки[0].КомиссияСтороннегоБрокера;				
			КонецЕсли;
		КонецЕсли;			
			
		НоваяСтрока = Объект.Комиссии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
		НоваяСтрока.КомиссияИтого = НоваяСтрока.КомиссияБрокера + НоваяСтрока.КомиссияСтороннегоБрокера;
		НоваяСтрока.Обрабатывать = Истина;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажки(Режим)
	
	Для Каждого ТекСтрока Из Объект.Комиссии Цикл		
		ТекСтрока.Обрабатывать = Режим;
	КонецЦикла;
	
КонецПроцедуры // УстановитьСнятьФлажки	

&НаКлиенте
Процедура ОбновитьНадписиКомиссии(ЭтоКомиссияСтороннегоБрокера = Ложь)
	
	РазницаКомиссийБрокера = РассчитатьРазницуКомиссий(ЭтоКомиссияСтороннегоБрокера);
	ТекЭлемент = ?(ЭтоКомиссияСтороннегоБрокера, Элементы.ДекорацияКомиссияСтороннегоБрокераРазница, Элементы.ДекорацияКомиссияБрокераРазница);
	ТекЭлемент.Заголовок = РазницаКомиссийБрокера;

КонецПроцедуры // ОбновитьНадписиКомиссии()
	   	
&НаСервереБезКонтекста
Функция СоздатьОбновитьДокументНачисленияЗадолженности(ПараметрыДокумента, ПараметрыСессии = Неопределено)
	
	Организация 				 = ПараметрыДокумента.Организация;
	СчетДоверительногоУправления = ПараметрыДокумента.СчетДоверительногоУправления;
	Контрагент                   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо");
	Период                       = ПараметрыДокумента.Период;
	Валюта                       = ПараметрыДокумента.Валюта;
	Сумма                        = ПараметрыДокумента.Сумма;
	Документ                     = ПараметрыДокумента.Документ;
	ДатаНачисления               = ПараметрыДокумента.ДатаНачисления;
	
	Если Не ЗначениеЗаполнено(Документ) Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор,
		|	ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Организация = &Организация
		|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего)
		|	И ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствам.Регистратор) = ТИП(Документ.НачислениеЗадолженности)";
		
		Запрос.УстановитьПараметр("НачалоПериода", 					НачалоМесяца(Период));
		Запрос.УстановитьПараметр("КонецПериода", 					КонецМесяца(Период));
		Запрос.УстановитьПараметр("Организация",   					Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",   СчетДоверительногоУправления);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() > 1 Тогда
			ДобавитьТекстОшибки(ПараметрыСессии, "Обнаружено более одного документа начисления комиссии по счету д/у " + СокрЛП(СчетДоверительногоУправления));
			Возврат Новый Структура("Результат, Комментарий", Ложь, "Обнаружено более одного документа начисления комиссии по счету д/у " + СокрЛП(СчетДоверительногоУправления));
		КонецЕсли;
		
		Если Выборка.Количество() = 0 Тогда                       
			// Создаем новый документ 		
			НачислениеЗадолженности = Документы.НачислениеЗадолженности.СоздатьДокумент();		
		Иначе                                                                    		
			Выборка.Следующий();
			НачислениеЗадолженности = Выборка.Регистратор.ПолучитьОбъект();               		
		КонецЕсли;
	Иначе
		НачислениеЗадолженности = Документ.ПолучитьОбъект();
	КонецЕсли;
	
	НачислениеЗадолженности.Основания.Очистить();

	НачислениеЗадолженности.Дата									= ДатаНачисления + 14*60*60;
	НачислениеЗадолженности.Организация								= Организация;
	НачислениеЗадолженности.ВидЗадолженности						= Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего;
	НачислениеЗадолженности.СчетДоверительногоУправления			= СчетДоверительногоУправления;
	НачислениеЗадолженности.МестоХранения							= Справочники.МестаХранения.ВнебиржевойРынок;
	НачислениеЗадолженности.Валюта									= Валюта;
	НачислениеЗадолженности.Контрагент								= Контрагент;
	НачислениеЗадолженности.Ответственный							= РаботаСПользователями.ТекущийПользователь();
	НачислениеЗадолженности.ПрочиеДоходыИРасходы					= Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по услугам депозитария");
	НачислениеЗадолженности.ГруппаФинансовогоУчетаДоходовРасходов	= БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаПоПрочимДоходамРасходам(
																							ДатаНачисления,
																							Организация,
																							СчетДоверительногоУправления,
																							НачислениеЗадолженности.ВидЗадолженности,
																							НачислениеЗадолженности.ПрочиеДоходыИРасходы);
	
	НачислениеЗадолженности.ДатаПолученияДокумента					= НачислениеЗадолженности.Дата;
	
	НачислениеЗадолженности.Договор = ПолучитьДоговорДепозитарногоОбслуживания(Организация, СчетДоверительногоУправления);
	
	НоваяСтрокаОснования = НачислениеЗадолженности.Основания.Добавить();
	НоваяСтрокаОснования.Сумма = Сумма;
	
	Если Не НачислениеЗадолженности.ПроверитьЗаполнение() Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Не удалось создать начисление задолженности");
		Возврат Новый Структура("Результат, Комментарий", Ложь, "Не удалось создать начисление задолженности");	
	КонецЕсли;
	
	Попытка
		НачислениеЗадолженности.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Структура("Результат, Комментарий", Ложь, "Не удалось создать начисление задолженности");	
	КонецПопытки;   
	
	
	Возврат Новый Структура("Результат, Комментарий, Документ", Истина, "", НачислениеЗадолженности.Ссылка);
	
КонецФункции // СоздатьОбновитьДокументНачисленияЗадолженности() 

&НаСервереБезКонтекста
Функция ПолучитьДоговорДепозитарногоОбслуживания(Организация, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор КАК Договор
	|ИЗ
	|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
	|ГДЕ
	|	ИсполнителиПоЦеннымБумагам.Организация = &Организация
	|	И ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Организация", 				  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Договор;
	Иначе
		Возврат Справочники.Договоры.ПустаяСсылка();
	КонецЕсли;		
	
КонецФункции // ПолучитьДоговорДепозитарногоОбслуживания()

&НаСервереБезКонтекста
Функция СоздатьОбновитьДокументОплаты(ПараметрыДокумента, ПараметрыСессии = Неопределено)
	
	Организация = ПараметрыДокумента.Организация;
	СчетДоверительногоУправления = ПараметрыДокумента.СчетДоверительногоУправления;
	Контрагент                   = ПараметрыДокумента.Контрагент;
	Период                       = ПараметрыДокумента.Период;
	Валюта                       = ПараметрыДокумента.Валюта;
	Сумма                        = ПараметрыДокумента.Сумма;
	ДокументНачисления           = ПараметрыДокумента.ДокументНачисления;
	ДокументОплаты	             = ПараметрыДокумента.Документ;
	ДатаОплаты                   = ПараметрыДокумента.ДатаОплаты;
	
	Если Не ЗначениеЗаполнено(ДокументНачисления) Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Сначала нужно создать документ начисления по счету д/у " + СокрЛП(СчетДоверительногоУправления));
		Возврат Новый Структура("Результат, Комментарий", Ложь, "Сначала нужно создать документ начисления по счету д/у " + СокрЛП(СчетДоверительногоУправления));		
	КонецЕсли;
	
	// Дублирование оплат проверяем в любом случае, т. к. пользователи разбивают платежи 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор,
	|	ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
	|		ПО ЗадолженностиПоДенежнымСредствам.Регистратор = ОплатаОснования.Ссылка
	|ГДЕ
	|	ЗадолженностиПоДенежнымСредствам.Организация = &Организация
	|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария)
	|	И ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствам.Регистратор) = ТИП(Документ.Оплата)
	|	И ОплатаОснования.Основание = &НачислениеЗадолженности";
	
	Запрос.УстановитьПараметр("НачалоПериода", 					НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода", 					КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация",   					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",   СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачислениеЗадолженности",   		ДокументНачисления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 1 Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Обнаружено более одного документа оплаты комиссии по счету д/у " + СокрЛП(СчетДоверительногоУправления));
		Возврат Новый Структура("Результат, Комментарий", Ложь, "Обнаружено более одного документа оплаты комиссии по счету д/у " + СокрЛП(СчетДоверительногоУправления));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОплаты) Тогда 
		Оплата = ДокументОплаты.ПолучитьОбъект();
		Если Оплата.Проведен Тогда
			Оплата.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	Иначе	
		
		Если Выборка.Количество() = 0 Тогда                       
			// Создаем новый документ 		
			Оплата = Документы.Оплата.СоздатьДокумент();		
		Иначе                                                                    		
			Выборка.Следующий();
			Оплата = Выборка.Регистратор.ПолучитьОбъект();			
		КонецЕсли;
		
	КонецЕсли;	
	
	Оплата.Основания.Очистить();
	
	Оплата.Заполнить(ДокументНачисления);
	
	Оплата.Дата = ДатаОплаты + 14*60*60 + 1;
		
	Если Не Оплата.ПроверитьЗаполнение() Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Не удалось создать документ оплаты");
		Возврат Новый Структура("Результат, Комментарий", Ложь, "Не удалось создать документ оплаты");	
	КонецЕсли;
	
	Попытка
		Оплата.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Структура("Результат, Комментарий", Ложь, "Не удалось создать документ оплаты");	
	КонецПопытки;   
	
	Возврат Новый Структура("Результат, Комментарий, Документ", Истина, "", Оплата.Ссылка);
	
КонецФункции // СоздатьОбновитьДокументОплаты() 

&НаСервере 
Функция РассчитатьРазницуКомиссий(ЭтоКомиссияСтороннегоБрокера = Ложь)
	
	Разница = 0;
	
	ИтогПоКолонке = Объект.Комиссии.Итог(?(ЭтоКомиссияСтороннегоБрокера, "КомиссияСтороннегоБрокера","КомиссияБрокера"));
	Разница = ?(ЭтоКомиссияСтороннегоБрокера, Объект.КомиссияСтороннегоБрокера, Объект.КомиссияБрокера) - ИтогПоКолонке;
	
	Возврат "Отклонение: " + Формат(Разница, "ЧДЦ=2; ЧРГ=' '; ЧН=0" );
	
КонецФункции // РассчитатьРазницуКомиссий

&НаКлиенте
Процедура РассчитатьИтоговуюКомиссию()
	
	ТекущаяСтрока = Элементы.Комиссии.ТекущиеДанные;
	ТекущаяСтрока.КомиссияИтого = ТекущаяСтрока.КомиссияБрокера + ТекущаяСтрока.КомиссияСтороннегоБрокера;
	
КонецПроцедуры // РассчитатьИтоговуюКомиссию

&НаСервереБезКонтекста
// Параметры:
//  РаспределяемаяСумма - Число - сумма, которую надо распределить;
//  Таблица - ТаблицаЗначений – переданная таблица значений
Процедура РаспределитьСуммуПоКолонкеТаблицы(РаспределяемаяСумма, Таблица, ИмяКолонки = "КомиссияСтороннегоБрокера", ИмяКолонкиБазы = "КомиссияБрокера")

	Если РаспределяемаяСумма <> 0 Тогда
		МассивСтарыхСумм = Таблица.ВыгрузитьКолонку(ИмяКолонкиБазы);
		МассивНовыхСумм = РаспределитьСуммуПропорциональноКоэффициентам(РаспределяемаяСумма, МассивСтарыхСумм);
		Если МассивНовыхСумм <> Неопределено Тогда
	 		Таблица.ЗагрузитьКолонку(МассивНовыхСумм, ИмяКолонки);
		КонецЕсли; 
	Иначе
		Таблица.ЗаполнитьЗначения(0, ИмяКолонки);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения.
//
// Параметры:
//  РаспределяемаяСумма - Число - сумма, которую надо распределить;
//  МассивКоэффициентов - Массив - коэффициенты распределения;
//  Точность - Число - точность округления при распределении. Необязателен.
//
// Возвращаемое значение:
//  Массив - массив размерностью равный массиву коэффициентов, содержит
//           суммы в соответствии с весом коэффициента (из массива коэффициентов).
//           В случае если распределить не удалось (сумма = 0, кол-во коэффициентов = 0,
//           или суммарный вес коэффициентов = 0), тогда возвращается значение Неопределено.
//
Функция РаспределитьСуммуПропорциональноКоэффициентам(Знач РаспределяемаяСумма, Коэффициенты, Знач Точность = 2)
	
	Если Коэффициенты.Количество() = 0 Или Не ЗначениеЗаполнено(РаспределяемаяСумма) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексМаксимальногоКоэффициента = 0;
	МаксимальныйКоэффициент = 0;
	РаспределеннаяСумма = 0;
	СуммаКоэффициентов  = 0;
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Коэффициент = Коэффициенты[Индекс];
		
		АбсолютноеЗначениеКоэффициента = ?(Коэффициент > 0, Коэффициент, -Коэффициент);
		Если МаксимальныйКоэффициент < АбсолютноеЗначениеКоэффициента Тогда
			МаксимальныйКоэффициент = АбсолютноеЗначениеКоэффициента;
			ИндексМаксимальногоКоэффициента = Индекс;
		КонецЕсли;
		
		СуммаКоэффициентов = СуммаКоэффициентов + Коэффициент;
	КонецЦикла;
	
	Если СуммаКоэффициентов = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив(Коэффициенты.Количество());
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Результат[Индекс] = Окр(РаспределяемаяСумма * Коэффициенты[Индекс] / СуммаКоэффициентов, Точность, 1);
		РаспределеннаяСумма = РаспределеннаяСумма + Результат[Индекс];
	КонецЦикла;
	
	// Погрешности округления отнесем на коэффициент с максимальным весом.
	Если Не РаспределеннаяСумма = РаспределяемаяСумма Тогда
		Результат[ИндексМаксимальногоКоэффициента] = Результат[ИндексМаксимальногоКоэффициента] + РаспределяемаяСумма - РаспределеннаяСумма;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаСервере
Функция ПечатьНаСервере()
	
	Результат = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПечатнаяФорма");
	
	СтруктураДанных = ПолучитьДанные();
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Если СтруктураДанных.Свойство("ДанныеОрганизации") Тогда
		ДанныеОрганизации = СтруктураДанных.ДанныеОрганизации;
		Если ДанныеОрганизации.Количество() > 0 Тогда
			ОбластьШапка.Параметры.Заполнить(ДанныеОрганизации[0]);
		КонецЕсли;
	КонецЕсли;
	
	ОбластьШапка.Параметры.Дата      = Формат(Объект.ДатаНачисленияКомиссии, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Период    = Формат(Объект.КонецПериода, "ДФ='MMMM yyyy'");
	ОбластьШапка.Параметры.Стратегия = Объект.Стратегия;
	
	Результат.Вывести(ОбластьШапка);
		
	Если СтруктураДанных.Свойство("Комиссии") Тогда
		Комиссии = СтруктураДанных.Комиссии;
		Для Каждого ТекСтрокаКомиссии Из Комиссии Цикл
			ОбластьСтрока.Параметры.Заполнить(ТекСтрокаКомиссии);
			Результат.Вывести(ОбластьСтрока);	
		КонецЦикла;		
	КонецЕсли;  	
	
	Если СтруктураДанных.Свойство("ФИОПодписанта") Тогда
		ФИОПодписанта = СтруктураДанных.ФИОПодписанта[0];
		СтрокаФИОПодписанта = Лев(ФИОПодписанта.Имя, 1) + ". " + Лев(ФИОПодписанта.Отчество, 1) + ". " + СокрЛП(ФИОПодписанта.Фамилия);
	Иначе	
		СтрокаФИОПодписанта = СокрЛП(ЭтотОбъект.Подписант);
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ДолжностьПодписанта = СокрЛП(ЭтотОбъект.ПодписантДолжность);
	ОбластьПодвал.Параметры.Подписант           = СтрокаФИОПодписанта;
	
	Результат.Вывести(ОбластьПодвал);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьДанные()
	
	СтруктураДанных = Новый Структура;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Подписант) Тогда
		Возврат СтруктураДанных;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
	|	РеквизитыЮридическихЛицСрезПоследних.КПП КАК КПП,
	|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
	|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
	|	РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование КАК СокращенноеНаименование,
	|	РеквизитыЮридическихЛицСрезПоследних.ОрганизационноПравоваяФорма КАК ОрганизационноПравоваяФорма,
	|	КонтактнаяИнформацияСрезПоследних.Представление КАК Адрес
	|ИЗ
	|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|			&Дата,
	|			ЮрФизЛицо = &ОрганизацияЮрФизЛицо
	|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&Дата,
	|				Вид = &Вид
	|					И Тип = &Тип) КАК КонтактнаяИнформацияСрезПоследних
	|		ПО (КонтактнаяИнформацияСрезПоследних.Объект = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Комиссии.НомерСтроки КАК НомерСтроки,
	|	Комиссии.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	Комиссии.КомиссияБрокера КАК КомиссияБрокера,
	|	Комиссии.КомиссияСтороннегоБрокера КАК КомиссияСтороннегоБрокера,
	|	Комиссии.КомиссияИтого КАК КомиссияИтого
	|ПОМЕСТИТЬ _Комиссии
	|ИЗ
	|	&ТЧКомиссии КАК Комиссии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Комиссии.НомерСтроки КАК НомерСтроки,
	|	_Комиссии.КомиссияБрокера КАК СуммаКомиссииДепозитария,
	|	_Комиссии.КомиссияСтороннегоБрокера КАК СуммаКомиссииТретьихЛиц,
	|	_Комиссии.КомиссияИтого КАК ИтогоКомиссии,
	|	СчетаДоверительногоУправления.Наименование КАК НаименованиеКлиента,
	|	СчетаДоверительногоУправления.НомерДоговора КАК ДоговорДУ
	|ИЗ
	|	_Комиссии КАК _Комиссии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
	|		ПО _Комиссии.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
	|ГДЕ
	|	_Комиссии.КомиссияИтого <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	РеквизитыФизическихЛицСрезПоследних.Имя КАК Имя,
	|	РеквизитыФизическихЛицСрезПоследних.Отчество КАК Отчество
	|ИЗ
	|	РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
	|			&Дата,
	|			ЮрФизЛицо = &ФизЛицо
	|				И Организация = &Организация
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _Комиссии";

	Запрос.УстановитьПараметр("Дата",        Объект.ДатаНачисленияКомиссии);
	Запрос.УстановитьПараметр("Вид",         Справочники.ВидыКонтактнойИнформации.ЮридическийАдрес);
	Запрос.УстановитьПараметр("Тип",         Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ОрганизацияЮрФизЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ТЧКомиссии",  Объект.Комиссии.Выгрузить());
	Запрос.УстановитьПараметр("ФизЛицо",  	 ЭтотОбъект.Подписант);
	
	Результат = Запрос.ВыполнитьПакет();
	
	СтруктураДанных.Вставить("ДанныеОрганизации", Результат[0].Выгрузить());
	СтруктураДанных.Вставить("Комиссии", 		  Результат[2].Выгрузить());
	СтруктураДанных.Вставить("ФИОПодписанта", 	  Результат[3].Выгрузить());
	
	Возврат СтруктураДанных;
	
КонецФункции // ПолучитьДанные()

&НаКлиенте
Процедура Печать(Команда)

	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Печать");
	Попытка
		ВыполнитьПечать(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПечать(ПараметрыСессии)

	Результат = ПечатьНаСервере();
	
	//Результат                 = Новый ТабличныйДокумент;
	Результат.ТолькоПросмотр  = Истина;
	Результат.АвтоМасштаб     = Истина;
	Результат.ОтображатьСетку = Ложь;
	
	Результат.Показать("Распределение комиссии депозитария");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
